{
  "Gibraltar" : "Gibraltar (/dʒɪˈbrɔːltər/ ⓘ jih-BRAWL-tər, Spanish: [xiβɾalˈtaɾ]) is a British Overseas Territory[a] and city[6] located at the southern tip of the Iberian Peninsula, on the Bay of Gibraltar, near the exit of the Mediterranean Sea into the Atlantic Ocean (Strait of Gibraltar).[7][8] It has an area of 6.8 km2 (2.6 sq mi)[3] and is bordered to the north by Spain (Campo de Gibraltar). The landscape is dominated by the Rock of Gibraltar, at the foot of which is a densely populated town area. Gibraltar is home to some 34,003 people, primarily Gibraltarians.[9]",
  "Cyprus" : "Cyprus[f] (/ˈsaɪprəs/ ⓘ), officially the Republic of Cyprus,[g] is an island country in the eastern Mediterranean Sea. Although it is geographically located in West Asia, its cultural identity and geopolitical make-up are overwhelmingly Southeast European. It is the third largest and third most populous island in the Mediterranean, after Sicily and Sardinia.[9][10] It is located southeast of Greece, south of Turkey, west of Syria and Lebanon, northwest of Israel and Palestine, and north of Egypt. Its capital and largest city is Nicosia. Cyprus hosts the British-controlled military bases Akrotiri and Dhekelia, whilst the northeast portion of the island is de facto governed by the self-declared Turkish Republic of Northern Cyprus, which is separated from the Republic of Cyprus by the United Nations Buffer Zone.",
  "Portugal" : "Portugal,[f] officially the Portuguese Republic,[g] is a country in the Iberian Peninsula in Southwestern Europe. Featuring the westernmost point in continental Europe, Portugal borders Spain to its north and east, with which it shares the longest uninterrupted border in the European Union; to the south and the west is the North Atlantic Ocean; and to the west and southwest lie the Macaronesian archipelagos of the Azores and Madeira, which are the two autonomous regions of Portugal. Lisbon is the capital and largest city, followed by Porto, which is the only other metropolitan area.",
  "Åland Islands" : "Åland (/ˈɔːlənd/[9] AW-lənd, Swedish: [ˈǒːland] ⓘ; Finnish: Ahvenanmaa) is an autonomous and demilitarised region of Finland. Receiving its autonomy by a 1920 decision of the League of Nations,[1] it is the smallest region of Finland by both area (1,580 km2 or 610 sq mi) and population (30,541), constituting 0.51% of Finland's land area and 0.54% of its population. Its only official language is Swedish and the capital city is Mariehamn.",
  "Iceland" : "Iceland[e] is a Nordic island country between the North Atlantic and Arctic Oceans, on the Mid-Atlantic Ridge between North America and Europe. It is culturally and politically linked with Europe and is the region's westernmost and most sparsely populated country.[12] Its capital and largest city is Reykjavík, which is home to about 36% of the country's roughly 380,000 residents (excluding nearby towns/suburbs, which are separate municipalities). The official language of the country is Icelandic. Iceland is on a rift between tectonic plates, and its geologic activity includes geysers and frequent volcanic eruptions.[13][14] The interior consists of a volcanic plateau with sand and lava fields, mountains and glaciers, and many glacial rivers flow to the sea through the lowlands. Iceland is warmed by the Gulf Stream and has a temperate climate, despite being a latitude just south of the Arctic Circle. Its latitude and marine influence keep summers chilly, and most of its islands have a polar climate.",
  "Greece" : "Greece,[c] officially the Hellenic Republic,[d] is a country in Southeast Europe. Located on the southern tip of the Balkan peninsula, Greece shares land borders with Albania to the northwest, North Macedonia and Bulgaria to the north, and Turkey to the east. The Aegean Sea lies to the east of the mainland, the Ionian Sea to the west, and the Sea of Crete and the Mediterranean Sea to the south. Greece has the longest coastline on the Mediterranean Basin, featuring thousands of islands. The country comprises nine traditional geographic regions, and has a population of over 10 million. Athens is the nation's capital and its largest city, followed by Thessaloniki and Patras.",
  "Austria" : "Austria,[e] formally the Republic of Austria,[f] is a landlocked country in Central Europe, lying in the Eastern Alps.[15] It is a federation of nine states, of which the capital Vienna is the most populous city and state. Austria is bordered by Germany to the northwest, the Czech Republic to the north, Slovakia to the northeast, Hungary to the east, Slovenia and Italy to the south, and Switzerland and Liechtenstein to the west. The country occupies an area of 83,879 km2 (32,386 sq mi) and has a population of around 9 million.[10]",
  "Latvia" : "Latvia,[a] officially the Republic of Latvia,[b][14] is a country in the Baltic region of Northern Europe. It is one of the three Baltic states, along with Estonia to the north and Lithuania to the south. It borders Russia to the east and Belarus to the southeast, and shares a maritime border with Sweden to the west. Latvia covers an area of 64,589 km2 (24,938 sq mi), with a population of 1.9 million. The country has a temperate seasonal climate.[15] Its capital and largest city is Riga. Latvians, who are the titular nation and comprise 63.0% of the country's population, belong to the ethnolinguistic group of the Balts and speak Latvian. Russians are the most prominent minority in the country, at almost a quarter of the population; 37.7% of the population speak Russian as their native tongue.[16]",
  "Monaco" : "Monaco,[a] officially the Principality of Monaco,[b] is a sovereign city-state and microstate on the French Riviera a few kilometres west of the Italian region of Liguria, in Western Europe, on the Mediterranean Sea. It is a semi-enclave bordered by France to the north, east and west. The principality is home to nearly 39,000 residents as of the 2020s,[11] of whom about 9,883 are Monégasque nationals.[12] It is recognised as one of the wealthiest and most expensive places in the world.[13][14] The official language of Monaco is French. Monégasque, English and Italian are also spoken and understood by many residents.[c]",
  "Luxembourg" : "Luxembourg,[a] officially the Grand Duchy of Luxembourg,[b] is a landlocked country in Western Europe. It is bordered by Belgium to the west and north, Germany to the east, and France on the south. Its capital and most populous city, Luxembourg City,[10] is one of the four institutional seats of the European Union[c] and hosts several EU institutions, notably the Court of Justice of the European Union, the highest judicial authority in the EU.[11][12]",
  "Jersey" : "Jersey (/ˈdʒɜːrzi/ JUR-zee; Jèrriais: Jèrri [ʒɛri]), officially the Bailiwick of Jersey,[d][13][14][15] is an autonomous and self-governing island territory of the British Islands.[e] Although as a British Crown Dependency it is not a sovereign state, it has its own distinguishing civil and government institutions, so qualifies as a small nation or island country.[16][17][18] Located in Northwestern Europe, off the coast of north-west France, it is the largest of the Channel Islands and is 14 miles (23 km) from Normandy's Cotentin Peninsula.[18] The Bailiwick consists of the main island of Jersey and some surrounding uninhabited islands and rocks including Les Dirouilles, Les Écréhous, Les Minquiers, and Les Pierres de Lecq.[19]",
  "Slovenia" : "Slovenia,[a] officially the Republic of Slovenia,[b] is a country in Central Europe.[13][14] It borders Italy to the west, Austria to the north, Hungary to the northeast, Croatia to the south and southeast, and a short coastline within the Adriatic Sea to the southwest, which is part of the Mediterranean Sea.[15] Slovenia is mostly mountainous and forested,[16] covers 20,271 square kilometres (7,827 sq mi),[17] and has a population of approximately 2.1 million people.[18] Slovene is the official language.[19] Slovenia has a predominantly temperate continental climate,[20] with the exception of the Slovene Littoral and the Julian Alps. Ljubljana, the capital and largest city of Slovenia, is geographically situated near the centre of the country.[21] Other larger urban centers are Maribor, Ptuj, Kranj, Celje and Koper.",
  "Hungary" : "Hungary[c] is a landlocked country in Central Europe.[2] Spanning much of the Carpathian Basin, it is bordered by Slovakia to the north, Ukraine to the northeast, Romania to the east and southeast, Serbia to the south, Croatia and Slovenia to the southwest, and Austria to the west. Hungary lies within the drainage basin of the Danube River and is dominated by great lowland plains. It has a population of 9.6 million, consisting mostly of ethnic Hungarians (Magyars) and a significant Romani minority. Hungarian is the official language, and among the few in Europe outside the Indo-European family.[13] Budapest is the country's capital and largest city, and the dominant cultural and economic centre.[14][15]",
  "Isle of Man" : "The Isle of Man (Manx: Mannin [ˈmanɪnʲ], also Ellan Vannin [ˈɛlʲan ˈvanɪnʲ]), or Mann (/mæn/ man),[12] is a self-governing British Crown Dependency in the Irish Sea, between Great Britain and Ireland. As head of state, Charles III holds the title Lord of Mann and is represented by a Lieutenant Governor. The government of the United Kingdom is responsible for the Isle of Man's military defence and represents it abroad, but the Isle of Man still has a separate international identity.[13]",
  "Ukraine" : "Ukraine[a] is a country in Eastern Europe. It is the second-largest country in Europe after Russia, which borders it to the east and northeast.[b] Ukraine also borders Belarus to the north; Poland and Slovakia to the west; Hungary, Romania and Moldova[c] to the southwest; and the Black Sea and the Sea of Azov to the south and southeast.[d] Kyiv is the nation's capital and largest city, followed by Kharkiv, Odesa, and Dnipro. Ukraine's official language is Ukrainian.",
  "Moldova" : "Moldova,[d] officially the Republic of Moldova,[e] is a landlocked country in Eastern Europe, with an area of 33,483 km2 (12,928 sq mi) and population of 2.42 million.[16] Moldova is bordered by Romania to the west and Ukraine to the north, east, and south.[17] The unrecognised breakaway state of Transnistria lies across the Dniester river on the country's eastern border with Ukraine. Moldova is a unitary parliamentary representative democratic republic with its capital in Chișinău, the country's largest city and main cultural and commercial centre.",
  "Belarus" : "Belarus,[b] officially the Republic of Belarus,[c] is a landlocked country in Eastern Europe. It is bordered by Russia to the east and northeast, Ukraine to the south, Poland to the west, and Lithuania and Latvia to the northwest. Belarus spans an area of 207,600 square kilometres (80,200 sq mi) with a population of 9.1 million. The country has a hemiboreal climate and is administratively divided into six regions. Minsk is the capital and largest city; it is administered separately as a city with special status.",
  "Albania" : "Albania (/ælˈbeɪniə, ɔːl-/ ⓘ a(w)l-BAY-nee-ə; Albanian: Shqipëri or Shqipëria),[b] officially the Republic of Albania (Albanian: Republika e Shqipërisë),[c] is a country in Southeast Europe. It is located in the Balkans, on the Adriatic and Ionian Seas within the Mediterranean Sea, and shares land borders with Montenegro to the northwest, Kosovo to the northeast, North Macedonia to the east and Greece to the south. With an area of 28,748 km2 (11,100 sq mi), it has a varied range of climatic, geological, hydrological and morphological conditions. Albania's landscapes range from rugged snow-capped mountains in the Albanian Alps and the Korab, Skanderbeg, Pindus and Ceraunian Mountains, to fertile lowland plains extending from the Adriatic and Ionian seacoasts. Tirana is the capital and largest city in the country, followed by Durrës, Vlorë, and Shkodër.",
  "Belgium" : "Belgium,[b] officially the Kingdom of Belgium,[c] is a country in Northwestern Europe. Situated in a coastal lowland region known as the Low Countries, it is bordered by the Netherlands to the north, Germany to the east, Luxembourg to the southeast, France to the south, and the North Sea to the west. Belgium covers an area of 30,689 km2 (11,849 sq mi)[4] and has a population of more than 11.8 million;[7] its population density of 383/km2 (990/sq mi) ranks 22nd in the world and sixth in Europe. The capital and largest metropolitan region is Brussels;[d] other major cities are Antwerp, Ghent, Charleroi, Liège, Bruges, Namur, and Leuven.",
  "Faroe Islands" : "The Faroe Islands[b] (/ˈfɛəroʊ/ FAIR-oh) (alt. the Faroes) are an archipelago in the North Atlantic Ocean and an autonomous territory of the Kingdom of Denmark. Located between Iceland, Norway, and the United Kingdom, the islands have a population of 54,609 as of January 2025[update] and a land area of 1,393 km².[10] The official language is Faroese, which is partially mutually intelligible with Icelandic. The terrain is rugged, dominated by fjords and cliffs with sparse vegetation and few trees. As a result of its proximity to the Arctic Circle, the islands experience perpetual civil twilight during summer nights and very short winter days; nevertheless, they experience a subpolar oceanic climate and mild temperatures year-round due to the Gulf Stream.[11] The capital, Tórshavn, receives the fewest recorded hours of sunshine of any city in the world at only 840 per year.[12]",
  "Finland" : "Finland,[a] officially the Republic of Finland,[b][c] is a Nordic country in Northern Europe. It borders Sweden to the northwest, Norway to the north, and Russia to the east, with the Gulf of Bothnia to the west and the Gulf of Finland to the south, opposite Estonia. Finland has a population of 5.6 million.[10] Its capital and largest city is Helsinki. The majority of the population are ethnic Finns. The official languages are Finnish and Swedish; 84.1 percent of the population speak the first as their mother tongue and 5.1 percent the latter.[1][11] Finland's climate varies from humid continental in the south to boreal in the north. The land cover is predominantly boreal forest biome, with more than 180,000 recorded lakes.[12][13]",
  "North Macedonia" : "North Macedonia,[d] officially the Republic of North Macedonia,[e] is a landlocked country in Southeast Europe. It shares land borders with Greece to the south, Albania to the west, Bulgaria to the east, Kosovo[f] to the northwest and Serbia to the north.[8] It constitutes approximately the northern third of the larger geographical region of Macedonia. Skopje, the capital and largest city, is home to a quarter of the country's population of over 1.83 million. The majority of the residents are ethnic Macedonians, a South Slavic people. Albanians form a significant minority at around 25%, followed by Turks, Roma, Serbs, Bosniaks, Aromanians and a few other minorities.",
  "Italy" : "Italy,[a] officially the Italian Republic,[b] is a country in Southern and Western Europe.[c] It consists of a peninsula that extends into the Mediterranean Sea, with the Alps on its northern land border, as well as nearly 800 islands, notably Sicily and Sardinia. Italy shares land borders with France to the west; Switzerland and Austria to the north; Slovenia to the east; and the two enclaves of Vatican City and San Marino. It is the tenth-largest country in Europe by area, covering 301,340 km2 (116,350 sq mi), and the third-most populous member state of the European Union, with nearly 60 million inhabitants. Italy's capital and largest city is Rome; other major urban areas include Milan, Naples, Turin, Palermo, Bologna, Florence, Genoa, and Venice.",
  "Germany" : "Germany,[d] officially the Federal Republic of Germany,[e] is a country in Central Europe. It lies between the Baltic Sea and the North Sea to the north and the Alps to the south. Its sixteen constituent states have a total population of over 84 million in an area of 357,596 km2 (138,069 sq mi), making it the most populous member state of the European Union. It borders Denmark to the north, Poland and the Czech Republic to the east, Austria and Switzerland to the south, and France, Luxembourg, Belgium, and the Netherlands to the west. The nation's capital and most populous city is Berlin and its main financial centre is Frankfurt; the largest urban area is the Ruhr.",
  "Czechia" : "The Czech Republic,[c][12] also known as Czechia,[d][13] and historically known as Bohemia,[14] is a landlocked country in Central Europe. The country is bordered by Austria to the south, Germany to the west, Poland to the northeast, and Slovakia to the southeast.[15] The Czech Republic has a hilly landscape that covers an area of 78,871 square kilometers (30,452 sq mi) with a mostly temperate continental and oceanic climate. The capital and largest city is Prague; other major cities and urban areas include Brno, Ostrava, Plzeň and Liberec.",
  "Vatican City" : "Vatican City,[g] officially the Vatican City State (Italian: Stato della Città del Vaticano;[h] Latin: Status Civitatis Vaticanae),[i][j] is a landlocked sovereign state[18][19] and city-state. It is surrounded by Rome, the capital city of Italy, which it was historically a part of.[20][21] It became independent from the Kingdom of Italy in 1929 with the Lateran Treaty. It is governed by the Holy See, itself a sovereign entity under international law, which maintains its temporal power, governance, diplomacy, and spiritual independence. Vatican is also used as a metonym for the pope, the Holy See, and the Roman Curia.[k][22]",
  "Svalbard and Jan Mayen" : "Svalbard and Jan Mayen (Norwegian: Svalbard og Jan Mayen, ISO 3166-1 alpha-2: SJ, ISO 3166-1 alpha-3: SJM, ISO 3166-1 numeric: 744) is a statistical designation defined by ISO 3166-1 for a collective grouping of two remote jurisdictions of Norway: Svalbard and Jan Mayen. While the two are combined for the purposes of the International Organization for Standardization (ISO) category, they are not administratively related. This has further resulted in the country code top-level domain .sj being issued for Svalbard and Jan Mayen, and ISO 3166-2:SJ. The United Nations Statistics Division also uses this code, but has named it the Svalbard and Jan Mayen Islands.",
  "Malta" : "Malta,[b] officially the Republic of Malta,[c] is an island country in Southern Europe located in the Mediterranean Sea, between Sicily and North Africa. It consists of an archipelago 80 km (50 mi) south of Italy, 284 km (176 mi) east of Tunisia,[13] and 333 km (207 mi) north of Libya.[14][15] The two official languages are Maltese and English. The country's capital is Valletta, which is the smallest capital city in the EU by both area and population. It was also the first World Heritage City in Europe to become a European Capital of Culture in 2018.[16]",
  "Russia" : "Russia,[b] or the Russian Federation,[c] is a country spanning Eastern Europe and North Asia. It is the largest country in the world, and extends across eleven time zones, sharing land borders with fourteen countries.[d] Russia is the most populous country in Europe and the ninth-most populous country in the world. It is a highly urbanised country, with sixteen of its urban areas having more than 1 million inhabitants. Moscow, the most populous metropolitan area in Europe, is the capital and largest city of Russia, while Saint Petersburg is its second-largest city and cultural centre.",
  "Sweden" : "Sweden,[f] formally the Kingdom of Sweden,[g][h] is a Nordic country located on the Scandinavian Peninsula in Northern Europe. It borders Norway to the west and north, and Finland to the east. At 450,295 square kilometres (173,860 sq mi),[4] Sweden is the largest Nordic country by both area and population, and is the fifth-largest country in Europe. Its capital and largest city is Stockholm. Sweden has a population of 10.6 million, and a low population density of 25.5 inhabitants per square kilometre (66/sq mi); 88% of Swedes reside in urban areas.[10] They are mostly in the central and southern half of the country. Sweden's urban areas together cover 1.5% of its land area. Sweden has a diverse climate owing to the length of the country, which ranges from 55°N to 69°N.",
  "Netherlands" : "The Netherlands,[k] informally Holland, is a country in Northwestern Europe, with overseas territories in the Caribbean. It is the largest of the four constituent countries of the Kingdom of the Netherlands.[13] The Netherlands consists of twelve provinces; it borders Germany to the east and Belgium to the south, with a North Sea coastline to the north and west. It shares maritime borders with the United Kingdom, Germany, and Belgium.[14] The official language is Dutch, with West Frisian as a secondary official language in the province of Friesland.[1] Dutch, English, and Papiamento are official in the Caribbean territories.[1]",
  "Kosovo" : "Kosovo,[a] officially the Republic of Kosovo,[b] is a landlocked country in Southeast Europe with partial diplomatic recognition. It is bordered by Albania to the southwest, Montenegro to the west, Serbia to the north and east, and North Macedonia to the southeast. It covers an area of 10,887 km2 (4,203 sq mi) and has a population of approximately 1.6 million. Kosovo has a varied terrain, with high plains along with rolling hills and mountains, some of which have an altitude over 2,500 m (8,200 ft). Its climate is mainly continental with some Mediterranean and alpine influences.[15] Kosovo's capital and most populous city is Pristina; other major cities and urban areas include Prizren, Ferizaj, Gjilan and Peja.[16]",
  "Andorra" : "Andorra,[d] officially the Principality of Andorra,[2][e] is a sovereign landlocked country on the Iberian Peninsula, in the eastern Pyrenees in Southwestern Europe, bordered by France to the north and Spain to the south. Believed to have been created by Charlemagne, Andorra was ruled by the count of Urgell until 988, when it was transferred to the Roman Catholic Diocese of Urgell. The present principality was formed by a charter in 1278. It is currently headed by two co-princes: the Bishop of Urgell in Catalonia, Spain, and the president of France. Its capital and largest city is Andorra la Vella.",
  "Ireland" : "Ireland (/ˈaɪərlənd/ ⓘ, IRE-lənd; Irish: Éire [ˈeːɾʲə] ⓘ; Ulster-Scots: Airlann [ˈɑːrlən]) is an island in the North Atlantic Ocean, in Northwestern Europe. Geopolitically, the island is divided between the Republic of Ireland (officially named Ireland — a sovereign state covering five-sixths of the island) and Northern Ireland (part of the United Kingdom — covering the remaining sixth). It is separated from Great Britain to its east by the North Channel, the Irish Sea, and St George's Channel. Ireland is the second-largest island of the British Isles, the third-largest in Europe, and the twentieth-largest in the world.[10] As of 2022, the population of the entire island is just over 7 million, with 5.1 million in the Republic of Ireland and 1.9 million in Northern Ireland, ranking it the second-most populous island in Europe after Great Britain.[11]",
  "Liechtenstein" : "Liechtenstein[b] (/ˈlɪktənstaɪn/ ⓘ, LIK-tən-styne;[17] German pronunciation: [ˈlɪçtn̩ʃtaɪn] ⓘ; Alemannic German: Liachtaschta), officially the Principality of Liechtenstein (German: Fürstentum Liechtenstein [ˈfʏʁstn̩tuːm ˈlɪçtn̩ˌʃtaɪ̯n] ⓘ),[c][21] is a doubly landlocked German-speaking microstate in the Central European Alps, between Austria in the east and north and Switzerland in the west and south.[22] Liechtenstein is a semi-constitutional monarchy headed by the prince of Liechtenstein of the House of Liechtenstein, currently led by Hans-Adam II. It is Europe's fourth-smallest country, with an area of just over 160 square kilometres (62 square miles) and a population of 40,023.[23] It is the world's smallest country to border two countries,[24] and is one of the few countries with no debt.[25]",
  "Poland" : "Poland,[e] officially the Republic of Poland,[f] is a country in Central Europe. It extends from the Baltic Sea in the north to the Sudetes and Carpathian Mountains in the south, bordered by Lithuania and Russia[g] to the northeast, Belarus and Ukraine to the east, Slovakia and the Czech Republic to the south, and Germany to the west. The territory has a varied landscape, diverse ecosystems, and a temperate climate. Poland is composed of sixteen voivodeships and is the fifth most populous member state of the European Union (EU), with over 38 million people, and the fifth largest EU country by area, covering 312,696 km2 (120,733 sq mi). The capital and largest city is Warsaw; other major cities include Kraków, Wrocław, Łódź, Poznań, and Gdańsk.",
  "Slovakia" : "Slovakia,[b] officially the Slovak Republic,[c] is a landlocked country in Central Europe. It is bordered by Poland to the north, Ukraine to the east, Hungary to the south, Austria to the west, and the Czech Republic to the northwest. Slovakia's mostly mountainous territory spans about 49,000 km2 (19,000 sq mi), hosting a population exceeding 5.4 million. The capital and largest city is Bratislava, while the second largest city is Košice.",
  "France" : "France,[IX] officially the French Republic,[X] is a country located primarily in Western Europe. Its overseas regions and territories include French Guiana in South America, Saint Pierre and Miquelon in the North Atlantic, the French West Indies, and many islands in Oceania and the Indian Ocean, giving it one of the largest discontiguous exclusive economic zones in the world. Metropolitan France shares borders with Belgium and Luxembourg to the north; Germany to the northeast; Switzerland to the east; Italy and Monaco to the southeast; Andorra and Spain to the south; and a maritime border with the United Kingdom to the northwest. Its metropolitan area extends from the Rhine to the Atlantic Ocean and from the Mediterranean Sea to the English Channel and the North Sea. Its eighteen integral regions—five of which are overseas—span a combined area of 632,702 km2 (244,288 sq mi) and have an estimated total population of over 68.6 million as of January 2025[update]. France is a semi-presidential republic and its capital, largest city and main cultural and economic centre is Paris.",
  "Lithuania" : "Lithuania,[b] officially the Republic of Lithuania,[c] is a country in the Baltic region of Europe.[d] It is one of three Baltic states and lies on the eastern shore of the Baltic Sea, bordered by Latvia to the north, Belarus to the east and south, Poland to the south, and the Russian semi-exclave of Kaliningrad Oblast to the southwest, with a maritime border with Sweden to the west. Lithuania covers an area of 65,300 km2 (25,200 sq mi), with a population of 2.89 million. Its capital and largest city is Vilnius; other major cities include Kaunas, Klaipėda, Šiauliai and Panevėžys. Lithuanians who are the titular nation and form the majority of the country's population, belong to the ethnolinguistic group of Balts and speak Lithuanian.",
  "Serbia" : "Serbia,[e] officially the Republic of Serbia,[f] is a landlocked country in Southeast and Central Europe.[9][10] Located in the Balkans, it borders Hungary to the north, Romania to the northeast, Bulgaria to the southeast, North Macedonia to the south, Croatia and Bosnia and Herzegovina to the west, and Montenegro to the southwest. Serbia claims a border with Albania through the disputed territory of Kosovo. Serbia has about 6.6 million inhabitants, excluding Kosovo. Its capital Belgrade is also the largest city.",
  "Bulgaria" : "Bulgaria,[a] officially the Republic of Bulgaria,[b] is a country in Southeast Europe. It is situated on the eastern portion of the Balkans directly south of the Danube river and west of the Black Sea. Bulgaria is bordered by Greece and Turkey to the south, Serbia and North Macedonia to the west, and Romania to the north. It covers a territory of 110,994 square kilometres (42,855 sq mi) and is the tenth largest within the European Union and the sixteenth-largest country in Europe by area. Sofia is the nation's capital and largest city; other major cities include Burgas, Plovdiv, and Varna.",
  "Bosnia and Herzegovina" : "Bosnia and Herzegovina,[a][b] sometimes known as Bosnia-Herzegovina and informally as Bosnia, is a country in Southeast Europe. Situated on the Balkan Peninsula, it borders Serbia to the east, Montenegro to the southeast, and Croatia to the north and southwest. In the south it has a 20-kilometre-long (12-mile) coast on the Adriatic Sea. Bosnia has a moderate continental climate with hot summers and cold, snowy winters. In the central and eastern regions, the geography is mountainous, in the northwest it is moderately hilly, and in the northeast it is predominantly flat. Herzegovina, the smaller, southern region, has a Mediterranean climate and is mostly mountainous. Sarajevo is the capital and the largest city.",
  "Croatia" : "Croatia,[d] officially the Republic of Croatia,[e] is a country in Central and Southeast Europe, on the coast of the Adriatic Sea. It borders Slovenia to the northwest, Hungary to the northeast, Serbia to the east, Bosnia and Herzegovina and Montenegro to the southeast, and shares a maritime border with Italy to the west. Its capital and largest city, Zagreb, forms one of the country's primary subdivisions, with twenty counties. Other major urban centers include Split, Rijeka and Osijek. The country spans 56,594 square kilometres (21,851 square miles), and has a population of nearly 3.9 million.",
  "Romania" : "Romania[b] is a country located at the crossroads of Central, Eastern and Southeast Europe. It borders Ukraine to the north and east, Hungary to the west, Serbia to the southwest, Bulgaria to the south, Moldova to the east, and the Black Sea to the southeast. It has a mainly continental climate, and an area of 238,397 km2 (92,046 sq mi) with a population of 19 million people. Romania is the twelfth-largest country in Europe and the sixth-most populous member state of the European Union. Europe's second-longest river, the Danube, empties into the Danube Delta in the southeast of the country. The Carpathian Mountains cross Romania from the north to the southwest and include Moldoveanu Peak, at an altitude of 2,544 m (8,346 ft). Bucharest is the country's largest urban area and financial centre. Other major urban areas include Cluj-Napoca, Timișoara, Iași, Constanța and Brașov.",
  "United Kingdom" : "The United Kingdom of Great Britain and Northern Ireland, commonly known as the United Kingdom (UK) or Britain,[m] is a country in Northwestern Europe, off the coast of the continental mainland. It comprises England, Scotland, Wales and Northern Ireland.[n] The UK includes the island of Great Britain, the north-eastern part of the island of Ireland, and most of the smaller islands within the British Isles, covering 94,354 square miles (244,376 km2).[f] Northern Ireland shares a land border with the Republic of Ireland; otherwise, the UK is surrounded by the Atlantic Ocean, the North Sea, the English Channel, the Celtic Sea and the Irish Sea. It maintains sovereignty over the British Overseas Territories, which are located across various oceans and seas globally. The UK had an estimated population of over 68.2 million people in 2023. The capital and largest city of both England and the UK is London. The cities of Edinburgh, Cardiff and Belfast are the national capitals of Scotland, Wales and Northern Ireland.",
  "Switzerland" : "Switzerland,[d] officially the Swiss Confederation,[e] is a landlocked country located in west-central Europe.[f][14] It is bordered by Italy to the south, France to the west, Germany to the north, and Austria and Liechtenstein to the east. Switzerland is geographically divided among the Swiss Plateau, the Alps and the Jura; the Alps occupy the greater part of the territory, whereas most of the country's 9 million people are concentrated on the plateau, which hosts its largest cities and economic centres, including Zurich, Geneva, and Lausanne.[15]",
  "Spain" : "Spain,[g] or the Kingdom of Spain,[a][h] is a country in Southern and Western Europe with territories in North Africa.[i] Featuring the southernmost point of continental Europe, it is the largest country in Southern Europe and the fourth-most populous European Union member state. Spanning across the majority of the Iberian Peninsula, its territory also includes the Canary Islands, in the Eastern Atlantic Ocean, the Balearic Islands, in the Western Mediterranean Sea, and the autonomous cities of Ceuta and Melilla, in mainland Africa. Peninsular Spain is bordered to the north by France, Andorra, and the Bay of Biscay; to the east and south by the Mediterranean Sea and Gibraltar; and to the west by Portugal and the Atlantic Ocean. Spain's capital and largest city is Madrid, and other major urban areas include Barcelona, Valencia, Seville, Zaragoza, Málaga, Murcia, and Palma de Mallorca.",
  "Guernsey" : "Guernsey (/ˈɡɜːrnzi/ ⓘ GURN-zee; Guernésiais: Guernési; French: Guernesey) is the second-largest island in the Channel Islands, located 27 miles (43 km) west of the Cotentin Peninsula, Normandy. It is the largest island in the Bailiwick of Guernsey, which includes five other inhabited islands – Alderney, Herm, Jethou, Lihou and Sark – and many small islets and rocks. The bailiwick has a population of 63,950,[4] the vast majority of whom live on Guernsey, and the island has a land area of 24 square miles (62 km2).[6]",
  "Norway" : "Norway,[a] officially the Kingdom of Norway,[b] is a Nordic country located on the Scandinavian Peninsula in Northern Europe. The remote Arctic island of Jan Mayen and the archipelago of Svalbard also form part of the Kingdom of Norway.[note 5] Bouvet Island, located in the Subantarctic, is a dependency, and not a part of the Kingdom; Norway also claims the Antarctic territories of Peter I Island and Queen Maud Land. Norway has a population of 5.6 million. Its capital and largest city is Oslo. The country has a total area of 385,207 square kilometres (148,729 sq mi).[14] The country shares a long eastern border with Sweden, and is bordered by Finland and Russia to the northeast. Norway has an extensive coastline facing the Skagerrak strait, the North Atlantic Ocean, and the Barents Sea.",
  "Denmark" : "Denmark[a] is a Nordic country in Northern Europe. It is the metropole and most populous constituent of the Kingdom of Denmark,[N 7] also known as the Danish Realm, a constitutionally unitary state that includes the autonomous territories of the Faroe Islands and Greenland in the north Atlantic Ocean.[11] Metropolitan Denmark,[N 8] also called \"continental Denmark\" or \"Denmark proper\",[12] consists of the northern Jutland peninsula and an archipelago of 406 islands.[13] It is the southernmost of the Scandinavian countries, lying southwest of Sweden, south of Norway, and north of Germany, with which it shares a short border. Denmark proper is situated between the North Sea to the west and the Baltic Sea to the east.[N 9]",
  "San Marino" : "San Marino,[a] officially the Republic of San Marino,[b][7] is a landlocked country in Southern Europe, completely surrounded by Italy. Located on the northeastern slopes of the Apennine Mountains, it is the larger of two microstates within Italy, the other being Vatican City.[8]",
  "Montenegro" : "Montenegro[d] is a country in Southeast Europe, on the Balkan Peninsula.[10] Its 25 municipalities have a total population of 633,158 people in an area of 13,883 km2 (5,360 sq mi). It is bordered by Bosnia and Herzegovina to the northwest, Serbia to the northeast, Kosovo to the east, Albania to the southeast, Croatia to the west, and has a coastline along the Adriatic Sea to the southwest.[11] The capital and largest city is Podgorica, while Cetinje is the Old Royal Capital and cultural centre.[12]",
  "Estonia" : "Estonia,[b] officially the Republic of Estonia,[c] is a country in Northern Europe.[d] It is bordered to the north by the Gulf of Finland across from Finland, to the west by the Baltic Sea across from Sweden, to the south by Latvia, and to the east by Russia. The territory of Estonia consists of the mainland, the larger islands of Saaremaa and Hiiumaa, and over 2,300 other islands and islets on the east coast of the Baltic Sea.[4] Its capital Tallinn and Tartu are the two largest urban areas. The Estonian language is the official language and the first language of the majority of its population of c. 1.4 million.[6] Estonia is one of the least populous members of the European Union and NATO."
}